{"name": "Nilah", "subtitle": "the Joy Unbound", "role": "Fighter", "description": "Nilah is an ascetic warrior from a distant land, seeking the world's deadliest, most titanic opponents so that she might challenge and destroy them. Having won her power through an encounter with the long-imprisoned demon of joy, she has no emotions other than unceasing jubilation—a small price to pay for the vast strength she now possesses. Channeling the demon's liquid form into a blade of unparalleled might, she stands defiant against ancient threats long forgotten. ", "abilities": [{"position": "Passive", "name": "Joy Unending", "description": "Nilah gains increased experience from last-hitting minions along with the ability to enhance and share nearby healing and shielding from her allies.", "image": "https://ddragon.leagueoflegends.com/cdn/13.23.1/img/passive/NIlahP.png"}, {"position": "Q", "name": "Formless Blade", "description": "With a snap of her whip-blade, Nilah damages any enemies she hits in a straight line in her chosen direction. This action extends her attack range for a short duration.", "image": "https://ddragon.leagueoflegends.com/cdn/13.23.1/img/spell/NilahQ.png"}, {"position": "W", "name": "Jubilant Veil", "description": "Nilah envelops herself in mist, increasing her movement speed and allowing her to gracefully dodge all incoming attacks. Any allies she touches during the mist's duration will also gain this effect.", "image": "https://ddragon.leagueoflegends.com/cdn/13.23.1/img/spell/NilahW.png"}, {"position": "E", "name": "Slipstream", "description": "Nilah enthusiastically dashes toward her target, dealing damage to any enemies she passes through on the way.", "image": "https://ddragon.leagueoflegends.com/cdn/13.23.1/img/spell/NilahE.png"}], "skins": [{"name": "Nilah", "image": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nilah_0.jpg"}, {"name": "Star Guardian Nilah", "image": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nilah_1.jpg"}, {"name": "Coven Nilah", "image": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nilah_11.jpg"}]}